Tekla Open API Reference for Tekla Structures 2025
WpfProfileCatalog Events
The WpfProfileCatalog type exposes the following members.
Events
Name | Description
SelectClicked
 The SelectClicked event is raised when the Select button is clicked.
SelectionDone
 The SelectionDone event is raised when the selection has been done.
Top
See Also
Reference
WpfProfileCatalog Class
Tekla.Structures.Dialog.UIControls Namespace